In [1]:
import sqlalchemy

In [2]:
import pandas as pd

In [3]:
import psycopg2

In [4]:
from sqlalchemy import create_engine

In [5]:
import matplotlib.pyplot as plt

In [6]:
database_name = 'scooters' 
connection_string=f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [7]:
engine = create_engine(connection_string)

In [8]:
query='''
SELECT *
FROM scooters
LIMIT 10
'''
df=pd.read_sql_query(query, engine)

In [9]:
print(df)

              pubdatetime   latitude  longitude        sumdid sumdtype  \
0 2019-05-01 00:01:41.247  36.136822 -86.799877  PoweredLIRL1  Powered
1 2019-05-01 00:01:41.247  36.191252 -86.772945  PoweredXWRWC  Powered
2 2019-05-01 00:01:41.247  36.144752 -86.806293  PoweredMEJEH  Powered
3 2019-05-01 00:01:41.247  36.162056 -86.774688  Powered1A7TC  Powered
4 2019-05-01 00:01:41.247  36.150973 -86.783109  Powered2TYEF  Powered
5 2019-05-01 00:01:41.247  36.157188 -86.769978  Powered3F3VK  Powered
6 2019-05-01 00:01:41.247  36.154348 -86.784765  PoweredVL7YG  Powered
7 2019-05-01 00:01:41.247  36.158930 -86.775987  Powered5LNUG  Powered
8 2019-05-01 00:01:41.247  36.135993 -86.804226  Powered7SPQQ  Powered
9 2019-05-01 00:01:41.247  36.148938 -86.811256  PoweredBV1DT  Powered

   chargelevel sumdgroup  costpermin companyname
0         93.0   scooter         0.0        Bird
1         35.0   scooter         0.0        Bird
2         90.0   scooter         0.0        Bird
3         88.0   scooter         0.0        Bird
4         98.0   scooter         0.0        Bird
5         82.0   scooter         0.0        Bird
6         56.0   scooter         0.0        Bird
7        100.0   scooter         0.0        Bird
8         85.0   scooter         0.0        Bird
9         65.0   scooter         0.0        Bird

In [10]:
#pubdatetime, latitude, longitude, sumdid, sumdtype, chargelevel, sumdgroup, costpermin, companyname

In [11]:
query = '''
SELECT MIN(pubdatetime), MAX(pubdatetime)
FROM scooters
'''
df = pd.read_sql_query(query, engine)

print(df)

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [12]:
query = '''
SELECT *
FROM scooters
ORDER BY pubdatetime ASC
LIMIT 5
'''
df = pd.read_sql_query(query, engine)

print(df)

              pubdatetime   latitude  longitude        sumdid sumdtype  \
0 2019-05-01 00:01:41.247  36.191252 -86.772945  PoweredXWRWC  Powered
1 2019-05-01 00:01:41.247  36.144752 -86.806293  PoweredMEJEH  Powered
2 2019-05-01 00:01:41.247  36.162056 -86.774688  Powered1A7TC  Powered
3 2019-05-01 00:01:41.247  36.150973 -86.783109  Powered2TYEF  Powered
4 2019-05-01 00:01:41.247  36.136822 -86.799877  PoweredLIRL1  Powered

   chargelevel sumdgroup  costpermin companyname
0         35.0   scooter         0.0        Bird
1         90.0   scooter         0.0        Bird
2         88.0   scooter         0.0        Bird
3         98.0   scooter         0.0        Bird
4         93.0   scooter         0.0        Bird

In [13]:
query = '''
SELECT *
FROM scooters
ORDER BY pubdatetime DESC
LIMIT 5
'''
df = pd.read_sql_query(query, engine)

print(df)

          pubdatetime   latitude  longitude  \
0 2019-07-31 23:59:57  36.165800 -86.777734
1 2019-07-31 23:59:57  36.155148 -86.785147
2 2019-07-31 23:59:57  36.145955 -86.810232
3 2019-07-31 23:59:57  36.145562 -86.811150
4 2019-07-31 23:59:57  36.158943 -86.777423

                                         sumdid sumdtype  chargelevel  \
0  Powered-751e19ec-b697-a51f-04ea-0bf9a2e125c9  Powered        65.44
1  Powered-5e26df3f-3475-f5dc-4361-86fa55423ff5  Powered        98.36
2  Powered-f4909631-d138-c9ee-cbec-8efc5568b77d  Powered       100.00
3  Powered-23fe9f5f-c8b4-9a26-5514-2d5d10d44dd0  Powered       100.00
4  Powered-d3563566-bcc1-23f7-0b91-c0d1a1efc925  Powered        76.79

  sumdgroup  costpermin companyname
0   Scooter         0.3        Bolt
1   Scooter         0.3        Bolt
2   Scooter         0.3        Bolt
3   Scooter         0.3        Bolt
4   Scooter         0.3        Bolt

In [14]:
query = '''
SELECT COUNT(DISTINCT companyname)
FROM scooters
'''
df = pd.read_sql_query(query, engine)

print(df)

   count
0      7

In [15]:
## there are (7) scooter companies

In [16]:
df.isna().sum()

count    0
dtype: int64

In [17]:
df.isna().any()

count    False
dtype: bool

In [18]:
df.isna().sum()

count    0
dtype: int64

In [19]:
result_trips = engine.execute("SELECT COUNT(DISTINCT companyname) AS num_companies FROM trips;")
num_companies_trips = result_trips.fetchone()[0]
print(f"Number of distinct companies in the trips table: {num_companies_trips}")

Number of distinct companies in the trips table: 7

In [20]:
result_scooters = engine.execute("SELECT COUNT(DISTINCT companyname) AS num_companies FROM scooters;")
num_companies_scooters = result_scooters.fetchone()[0]
print(f"Number of distinct companies in the scooters table: {num_companies_scooters}")

Number of distinct companies in the scooters table: 7

In [21]:
query = "SELECT companyname, COUNT(DISTINCT sumdid) AS num_sumdid FROM trips GROUP BY companyname;"
df = pd.read_sql_query(query, engine)

# Print the dataframe to the console
print(df)

     companyname  num_sumdid
0           Bird        3766
1  Bolt Mobility         356
2         Gotcha         166
3           JUMP         450
4           Lime        1788
5           Lyft        1725
6           SPIN         754

In [22]:
# how many times a day is each scooter used?
query = "SELECT sumdid, DATE(pubdatetime) AS date, COUNT(*) AS num_trips FROM scooters GROUP BY sumdid, DATE(pubdatetime);"
useage_df = pd.read_sql_query(query, engine)

print(useage_df)

                                              sumdid        date  num_trips
0       Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619  2019-05-24        181
1       Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619  2019-05-25        263
2       Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619  2019-05-26         62
3       Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619  2019-05-27        149
4       Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619  2019-05-28         84
...                                              ...         ...        ...
413558                         StandardNW5HJFO4R32LY  2019-07-28        288
413559                         StandardNW5HJFO4R32LY  2019-07-29        288
413560                         StandardNW5HJFO4R32LY  2019-07-30        287
413561                         StandardNW5HJFO4R32LY  2019-07-31        288
413562                         StandardZPUQESHVPP74J  2019-06-13          6

[413563 rows x 3 columns]

In [23]:
query = "SELECT sumdid, DATE(pubdatetime) AS date, COUNT(*) AS num_trips FROM scooters GROUP BY sumdid, DATE(pubdatetime) HAVING COUNT(*) < 3;"
lowuseage_df = pd.read_sql_query(query, engine)

print(lowuseage_df)

                                            sumdid        date  num_trips
0     Powered-1d88938b-8196-bd85-c06a-5be82c9a270b  2019-07-20          1
1     Powered-2ca61c2a-c3b9-686a-6f53-a5cecf61bb36  2019-07-25          2
2     Powered-40d728a6-1adb-3e5b-e813-5040890b64b5  2019-06-02          1
3     Powered-42343fcc-da6a-eac1-ab22-e6e31e320faf  2019-05-24          1
4     Powered-44c78418-a8f1-ff86-c13e-eb8fdb8ddd6c  2019-05-25          1
...                                            ...         ...        ...
1751                                  PoweredZVBW4  2019-05-06          1
1752                                  PoweredZXWYJ  2019-05-26          2
1753                                  PoweredZY5KX  2019-06-04          1
1754                                  PoweredZYM3M  2019-05-29          1
1755                                  PoweredZZ1Q6  2019-05-07          1

[1756 rows x 3 columns]

In [24]:
##Each scooter is not used three times a day, in fact 1756 were not used the minimum of three times a day

In [ ]:
query = "SELECT sumdid, DATE(pubdatetime) AS date, COUNT(*) AS num_trips FROM scooters GROUP BY sumdid, DATE(pubdatetime);"
trips_df = pd.read_sql_query(query, engine)

#average number of trips per day for each sumdid
avg_trips_df = trips_df.groupby(['sumdid'])['num_trips'].mean().reset_index()

print(avg_trips_df)

In [ ]:
# Did the # of scooters each company had available change over time??
query = """
    SELECT 
        companyname, 
        DATE_TRUNC('month', pubdatetime) AS month, 
        COUNT(DISTINCT sumdid) AS num_sumdid 
    FROM 
        scooters 
    GROUP BY 
        companyname, 
        month 
    ORDER BY 
        companyname, 
        month
"""
df = pd.read_sql_query(query, engine)

import seaborn as sns
import matplotlib.pyplot as plt

sns.set_style("darkgrid")
sns.set_palette("husl")
sns.lineplot(data=df, x='month', y='num_sumdid', hue='companyname')

# Customize the chart
plt.title("Number of sumdid for each company over time")
plt.xlabel("Month")
plt.ylabel("Number of sumdid")
plt.xticks(rotation=45)

plt.show()